ryankurte/efm32-base/device/EFR32FG22/Include/efr32fg22_rootcfg.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG22 ROOTCFG register and bit field definitions
 * @version 5.8.0
 ******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG22_ROOTCFG_H
#define EFR32FG22_ROOTCFG_H
#define ROOTCFG_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG22_ROOTCFG ROOTCFG
 * @{
 * @brief EFR32FG22 ROOTCFG Register Declaration.
 *****************************************************************************/

/** ROOTCFG BOOTREGS Register Group Declaration. */
typedef struct {
  __IOM uint32_t BOOTREG;                            /**< BOOTREG{r}                                         */
} ROOTCFG_BOOTREGS_TypeDef;

/** ROOTCFG Register Declaration. */
typedef struct {
  __IM uint32_t            IPVERSION;           /**< IP VERSION                                         */
  uint32_t                 RESERVED0[1U];       /**< Reserved for future use                      */
  __IOM uint32_t           EN;                  /**< Module Enable Register                             */
  uint32_t                 RESERVED1[61U];      /**< Reserved for future use*/
  __IOM uint32_t           BUSLOCK;             /**< Bus Lock                                           */
  __IOM uint32_t           REGLOCK;             /**< Register Lock                                      */
  __IOM uint32_t           MFRLOCK;             /**< Manufacture Lock                                   */
  __IOM uint32_t           ROOTMODELOCK;        /**< Root Mode Lock                                     */
  uint32_t                 RESERVED2[4U];       /**< Reserved for future use                      */
  __IOM uint32_t           ROOTDBGLOCK;         /**< Root Debug Lock                                    */
  uint32_t                 RESERVED3[7U];       /**< Reserved for future use                      */
  __IOM uint32_t           USERDBGLOCK;         /**< Host Invasive Debug Lock                           */
  __IOM uint32_t           USERNIDLOCK;         /**< Host Non-Invasive Debug Lock                       */
  __IOM uint32_t           USERSPIDLOCK;        /**< Host Secure Invasive Debug Lock                    */
  __IOM uint32_t           USERSPNIDLOCK;       /**< Host Secure Non-Invasive Debug Lock                */
  __IOM uint32_t           USERDBGAPLOCK;       /**< Host Debug Access Port Lock                        */
  uint32_t                 RESERVED4[3U];       /**< Reserved for future use                      */
  __IOM uint32_t           RADIODBGLOCK;        /**< RADIO Debug Lock                                   */
  uint32_t                 RESERVED5[5U];       /**< Reserved for future use                      */
  __IM uint32_t            MFRLOCKVAL0;         /**< Manufacture Lock Value 0                           */
  __IM uint32_t            MFRLOCKVAL1;         /**< Manufacture Lock Value 1                           */
  __IM uint32_t            LOCKSTATUS;          /**< Lock Status                                        */
  __IM uint32_t            UNLOCKSTATUS;        /**< Unlock Status                                      */
  uint32_t                 RESERVED6[30U];      /**< Reserved for future use*/
  __IOM uint32_t           CTRL;                /**< control signals for SE                             */
  __IM uint32_t            STATUS;              /**< Status register for SE                             */
  uint32_t                 RESERVED7[62U];      /**< Reserved for future use*/
  ROOTCFG_BOOTREGS_TypeDef BOOTREGS[4U];        /**<                                                   */
  uint32_t                 RESERVED8[828U];     /**< Reserved for future use*/
  __IM uint32_t            IPVERSION_SET;       /**< IP VERSION                                         */
  uint32_t                 RESERVED9[1U];       /**< Reserved for future use                      */
  __IOM uint32_t           EN_SET;              /**< Module Enable Register                             */
  uint32_t                 RESERVED10[61U];     /**< Reserved for future use*/
  __IOM uint32_t           BUSLOCK_SET;         /**< Bus Lock                                           */
  __IOM uint32_t           REGLOCK_SET;         /**< Register Lock                                      */
  __IOM uint32_t           MFRLOCK_SET;         /**< Manufacture Lock                                   */
  __IOM uint32_t           ROOTMODELOCK_SET;    /**< Root Mode Lock                                     */
  uint32_t                 RESERVED11[4U];      /**< Reserved for future use                      */
  __IOM uint32_t           ROOTDBGLOCK_SET;     /**< Root Debug Lock                                    */
  uint32_t                 RESERVED12[7U];      /**< Reserved for future use                      */
  __IOM uint32_t           USERDBGLOCK_SET;     /**< Host Invasive Debug Lock                           */
  __IOM uint32_t           USERNIDLOCK_SET;     /**< Host Non-Invasive Debug Lock                       */
  __IOM uint32_t           USERSPIDLOCK_SET;    /**< Host Secure Invasive Debug Lock                    */
  __IOM uint32_t           USERSPNIDLOCK_SET;   /**< Host Secure Non-Invasive Debug Lock                */
  __IOM uint32_t           USERDBGAPLOCK_SET;   /**< Host Debug Access Port Lock                        */
  uint32_t                 RESERVED13[3U];      /**< Reserved for future use                      */
  __IOM uint32_t           RADIODBGLOCK_SET;    /**< RADIO Debug Lock                                   */
  uint32_t                 RESERVED14[5U];      /**< Reserved for future use                      */
  __IM uint32_t            MFRLOCKVAL0_SET;     /**< Manufacture Lock Value 0                           */
  __IM uint32_t            MFRLOCKVAL1_SET;     /**< Manufacture Lock Value 1                           */
  __IM uint32_t            LOCKSTATUS_SET;      /**< Lock Status                                        */
  __IM uint32_t            UNLOCKSTATUS_SET;    /**< Unlock Status                                      */
  uint32_t                 RESERVED15[30U];     /**< Reserved for future use*/
  __IOM uint32_t           CTRL_SET;            /**< control signals for SE                             */
  __IM uint32_t            STATUS_SET;          /**< Status register for SE                             */
  uint32_t                 RESERVED16[62U];     /**< Reserved for future use*/
  ROOTCFG_BOOTREGS_TypeDef BOOTREGS_SET[4U];    /**<                                                   */
  uint32_t                 RESERVED17[828U];    /**< Reserved for future use*/
  __IM uint32_t            IPVERSION_CLR;       /**< IP VERSION                                         */
  uint32_t                 RESERVED18[1U];      /**< Reserved for future use                      */
  __IOM uint32_t           EN_CLR;              /**< Module Enable Register                             */
  uint32_t                 RESERVED19[61U];     /**< Reserved for future use*/
  __IOM uint32_t           BUSLOCK_CLR;         /**< Bus Lock                                           */
  __IOM uint32_t           REGLOCK_CLR;         /**< Register Lock                                      */
  __IOM uint32_t           MFRLOCK_CLR;         /**< Manufacture Lock                                   */
  __IOM uint32_t           ROOTMODELOCK_CLR;    /**< Root Mode Lock                                     */
  uint32_t                 RESERVED20[4U];      /**< Reserved for future use                      */
  __IOM uint32_t           ROOTDBGLOCK_CLR;     /**< Root Debug Lock                                    */
  uint32_t                 RESERVED21[7U];      /**< Reserved for future use                      */
  __IOM uint32_t           USERDBGLOCK_CLR;     /**< Host Invasive Debug Lock                           */
  __IOM uint32_t           USERNIDLOCK_CLR;     /**< Host Non-Invasive Debug Lock                       */
  __IOM uint32_t           USERSPIDLOCK_CLR;    /**< Host Secure Invasive Debug Lock                    */
  __IOM uint32_t           USERSPNIDLOCK_CLR;   /**< Host Secure Non-Invasive Debug Lock                */
  __IOM uint32_t           USERDBGAPLOCK_CLR;   /**< Host Debug Access Port Lock                        */
  uint32_t                 RESERVED22[3U];      /**< Reserved for future use                      */
  __IOM uint32_t           RADIODBGLOCK_CLR;    /**< RADIO Debug Lock                                   */
  uint32_t                 RESERVED23[5U];      /**< Reserved for future use                      */
  __IM uint32_t            MFRLOCKVAL0_CLR;     /**< Manufacture Lock Value 0                           */
  __IM uint32_t            MFRLOCKVAL1_CLR;     /**< Manufacture Lock Value 1                           */
  __IM uint32_t            LOCKSTATUS_CLR;      /**< Lock Status                                        */
  __IM uint32_t            UNLOCKSTATUS_CLR;    /**< Unlock Status                                      */
  uint32_t                 RESERVED24[30U];     /**< Reserved for future use*/
  __IOM uint32_t           CTRL_CLR;            /**< control signals for SE                             */
  __IM uint32_t            STATUS_CLR;          /**< Status register for SE                             */
  uint32_t                 RESERVED25[62U];     /**< Reserved for future use*/
  ROOTCFG_BOOTREGS_TypeDef BOOTREGS_CLR[4U];    /**<                                                   */
  uint32_t                 RESERVED26[828U];    /**< Reserved for future use*/
  __IM uint32_t            IPVERSION_TGL;       /**< IP VERSION                                         */
  uint32_t                 RESERVED27[1U];      /**< Reserved for future use                      */
  __IOM uint32_t           EN_TGL;              /**< Module Enable Register                             */
  uint32_t                 RESERVED28[61U];     /**< Reserved for future use*/
  __IOM uint32_t           BUSLOCK_TGL;         /**< Bus Lock                                           */
  __IOM uint32_t           REGLOCK_TGL;         /**< Register Lock                                      */
  __IOM uint32_t           MFRLOCK_TGL;         /**< Manufacture Lock                                   */
  __IOM uint32_t           ROOTMODELOCK_TGL;    /**< Root Mode Lock                                     */
  uint32_t                 RESERVED29[4U];      /**< Reserved for future use                      */
  __IOM uint32_t           ROOTDBGLOCK_TGL;     /**< Root Debug Lock                                    */
  uint32_t                 RESERVED30[7U];      /**< Reserved for future use                      */
  __IOM uint32_t           USERDBGLOCK_TGL;     /**< Host Invasive Debug Lock                           */
  __IOM uint32_t           USERNIDLOCK_TGL;     /**< Host Non-Invasive Debug Lock                       */
  __IOM uint32_t           USERSPIDLOCK_TGL;    /**< Host Secure Invasive Debug Lock                    */
  __IOM uint32_t           USERSPNIDLOCK_TGL;   /**< Host Secure Non-Invasive Debug Lock                */
  __IOM uint32_t           USERDBGAPLOCK_TGL;   /**< Host Debug Access Port Lock                        */
  uint32_t                 RESERVED31[3U];      /**< Reserved for future use                      */
  __IOM uint32_t           RADIODBGLOCK_TGL;    /**< RADIO Debug Lock                                   */
  uint32_t                 RESERVED32[5U];      /**< Reserved for future use                      */
  __IM uint32_t            MFRLOCKVAL0_TGL;     /**< Manufacture Lock Value 0                           */
  __IM uint32_t            MFRLOCKVAL1_TGL;     /**< Manufacture Lock Value 1                           */
  __IM uint32_t            LOCKSTATUS_TGL;      /**< Lock Status                                        */
  __IM uint32_t            UNLOCKSTATUS_TGL;    /**< Unlock Status                                      */
  uint32_t                 RESERVED33[30U];     /**< Reserved for future use*/
  __IOM uint32_t           CTRL_TGL;            /**< control signals for SE                             */
  __IM uint32_t            STATUS_TGL;          /**< Status register for SE                             */
  uint32_t                 RESERVED34[62U];     /**< Reserved for future use*/
  ROOTCFG_BOOTREGS_TypeDef BOOTREGS_TGL[4U];    /**<                                                   */
} ROOTCFG_TypeDef;
/** @} End of group EFR32FG22_ROOTCFG */

/**************************************************************************//**
 * @addtogroup EFR32FG22_ROOTCFG
 * @{
 * @defgroup EFR32FG22_ROOTCFG_BitFields ROOTCFG Bit Fields
 * @{
 *****************************************************************************/

